[docs] mermaid -> D2
